{"pergunta": "Qual é o nome completo do curso DSM?", "resposta": "Curso Superior de Tecnologia em Desenvolvimento de Software Multiplataforma (DSM)."}
{"pergunta": "Qual é o tipo do curso DSM?", "resposta": "É um curso de Tecnólogo."}
{"pergunta": "Qual instituição oferece o curso DSM?", "resposta": "As Faculdades de Tecnologia (Fatec), vinculadas ao Centro Estadual de Educação Tecnológica Paula Souza (CEETEPS)."}
{"pergunta": "Qual é o eixo tecnológico do curso DSM?", "resposta": "Informação e Comunicação."}
{"pergunta": "Qual é a modalidade do curso DSM?", "resposta": "Presencial, com parte das aulas remotas em algumas unidades (modelo híbrido, especialmente no último semestre)."}
{"pergunta": "Quantos semestres tem o curso DSM?", "resposta": "O curso tem 6 semestres (3 anos)."}
{"pergunta": "Qual é a carga horária total do curso DSM?", "resposta": "Aproximadamente 2.640 horas, incluindo 2.400 horas de disciplinas e 240 horas de estágio supervisionado."}
{"pergunta": "Quantas vagas são oferecidas por semestre no curso DSM?", "resposta": "Normalmente cerca de 40 vagas por semestre, variando conforme a Fatec."}
{"pergunta": "Quais são as formas de ingresso no curso DSM?", "resposta": "Pelo Vestibular Fatec (com provas e redação) e, em alguns casos, por vagas remanescentes ou transferências."}
{"pergunta": "Qual é o objetivo principal do curso DSM?", "resposta": "Formar profissionais para projetar, desenvolver e testar softwares multiplataforma (Web, Desktop, Mobile, Nuvem e IoT)."}
{"pergunta": "Quais competências o egresso do curso DSM deve ter?", "resposta": "Desenvolver softwares, selecionar tecnologias adequadas, realizar testes e garantir segurança, além de trabalhar em equipe com ética e inovação."}
{"pergunta": "Quais são algumas disciplinas típicas do curso DSM?", "resposta": "Algoritmos e Lógica de Programação, Desenvolvimento Web I-III, Banco de Dados, Estrutura de Dados, Programação para Dispositivos Móveis, IoT, Computação em Nuvem, UX, Testes de Software, Integração Contínua e Inglês Técnico."}
{"pergunta": "O curso DSM possui certificações intermediárias?", "resposta": "Sim, há microcertificações e certificações intermediárias em áreas como Front-End, Back-End e Mobile."}
{"pergunta": "Qual é o prazo máximo para integralização do curso DSM?", "resposta": "Até cerca de 10 semestres, dependendo do regulamento de cada Fatec."}
{"pergunta": "Em que áreas o tecnólogo em DSM pode atuar?", "resposta": "Em empresas de tecnologia, consultorias, startups, setores público e privado, ou como autônomo/empreendedor."}
{"pergunta": "O curso DSM é pago?", "resposta": "Não, o curso é gratuito, pois a Fatec é uma instituição pública."}
{"pergunta": "Como é a infraestrutura do curso DSM?", "resposta": "As Fatecs oferecem laboratórios de informática, equipamentos de IoT, redes, salas de aula equipadas e suporte para desenvolvimento prático."}
{"pergunta": "O curso DSM tem enfoque prático?", "resposta": "Sim, com projetos, laboratórios, metodologias ágeis e resolução de problemas reais."}
